data/workspace/apps/molding_hub/test_sim/CFD_MeltFront/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       940;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       1140;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       1340;
    }
)

// ************************************************************************* //
