data/workspace/apps/molding_hub/test_sim/CFD_MeltFront/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (resin air);

resin
{
    transportModel  CrossWLF;
    nu              [ 0 2 -1 0 0 0 0 ] 1e-3; // Will be scaled by Cross-WLF
    rho             [ 1 -3 0 0 0 0 0 ] 1180;
    Cp              [ 0 2 -2 -1 0 0 0 ] 1550;
    kappa           [ 1 1 -3 -1 0 0 0 ] 0.28;
    
    // Cross-WLF Parameters for Polyamide 66 + 30% Glass Fiber (PA66-GF30)
    n               0.35;
    tau             45000;
    D1              1000000000000.0;
    D2              283.15;
    A1              28.0;
}

air
{
    transportModel  Newtonian;
    nu              [ 0 2 -1 0 0 0 0 ] 1.48e-05;
    rho             [ 1 -3 0 0 0 0 0 ] 1.2;
    Cp              [ 0 2 -2 -1 0 0 0 ] 1004.4;
    kappa           [ 1 1 -3 -1 0 0 0 ] 0.026;
}

sigma           [ 1 0 -2 0 0 0 0 ] 0.03;

// ************************************************************************* //
