data/workspace/apps/molding_hub/test_sim/CFD_MeltFront/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
convertToMeters 1;

vertices
(
    (0 0 0)
    (0.1 0 0)
    (0.1 0.05 0)
    (0 0.05 0)
    (0 0 0.01)
    (0.1 0 0.01)
    (0.1 0.05 0.01)
    (0 0.05 0.01)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (20 10 2) simpleGrading (1 1 1)
);
edges ();
boundary
(
    inlet
    {
        type patch;
        faces ((0 3 2 1));
    }
    outlet
    {
        type patch;
        faces ((4 5 6 7));
    }
    walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (1 2 6 5)
            (0 1 5 4)
            (3 7 6 2)
        );
    }
);
