data/workspace/apps/molding_hub/test_sim/CFD_MeltFront/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
defaultFieldValues
(
    volScalarFieldValue alpha.resin 0
);
regions
(
    boxToCell
    {
        box (0 0 0) (0.02 0.05 0.01);
        fieldValues
        (
            volScalarFieldValue alpha.resin 1
        );
    }
);
